//Н

// -------------------------- Начало программы ----------------------------------
Console.Clear();
int x = 0;
InitCoordinatesByUser(ref x); // Вызов метода с передачей параметров по ссылке (ref)
PrintQuarterByCoords(x);          // Вызов метода с передачей параметров по значению
                                     // -------------------------- Конец программы ----------------------------------
                                     // -------------------------Определение методов ---------------------------------
                                     // ------------------------------------------------------------------------------
                                     // Определяем функцию, выполняющую ввод значений координат
static void InitCoordinatesByUser(ref int x)
{
    try
    {
        Console.Write("Введите номер четверти: ");
        x = int.Parse(Console.ReadLine() ?? "");
        
    }
    catch (Exception exc)
    {
        Console.WriteLine($"Ошибка ввода данных! {exc.Message}");
        return;
    }
}
// -----------------------------------------------------------------------------
// Определяем функцию, принимающую два аргумента (координаты точки x и y)
// и выводящую в консоль номер четверти плоскости, в которой находится эта точка
static void PrintQuarterByCoords(int x)
{
    if (x == 1)
        Console.WriteLine("Координаты X=[1:1000]; Координаты Y=[1:1000]");
    else if (x == 2)
        Console.WriteLine("Координаты X=[1:1000]; Координаты Y=[-1:-1000]");
    else if (x == 3)
        Console.WriteLine("Координаты X=[-1:-1000]; Координаты Y=[-1:-1000]");
    else if (x == 4)
        Console.WriteLine("Координаты X=[-1:-1000]; Координаты Y=[1:1000]");
    else
        Console.WriteLine("Ошибка! Точка попадает на оси координат!");
}
// ---------------------- Конец определения методов ----------------------------
